import { memo, useMemo } from "react";
import CategoryItems from "./CategoryItems";



function Phone({ device }) {
  const phoneItems = useMemo(
    () => ({
      title: "همه‌ی محصولات موبایل",
      maxDesktopColumn: 4,
      items: [
        {
          itemTile: "برند های مختلف گوشی موبایل",
          colNumber: 1,
          elements: [
            { name: "گوشی آیفون" },
            { name: "گوشی سامسونگ" },
            { name: "گوشی شیائومی" },
            { name: "گوشی نوکیا" },
            { name: "گوشی آنر" },
            { name: "گوشی ناتینگ فون" },
            { name: "گوشی ریلمی" },
            { name: "گوشی موتورولا" },
            { name: "گوشی تی سی ال" },
            { name: "گوشی هوآوی" },
            { name: "گوشی داریا" },
            { name: "گوشی گوگل پیکسل" },
            { name: "گوشی اوپو" },
            { name: "گوشی آلکاتل" },
            { name: "گوشی جی ال ایکس" },
            { name: "گوشی موبایل دو جی" },
            { name: "گوشی بلک ویو" },
            { name: "قیمت گوشی" },
          ],
        },
        {
          itemTile: "برند های برتر",
          colNumber: 1,
          elements: [
            { name: "سامسونگ" },
            { name: "اپل" },
            { name: "هوآوی" },
            { name: "آنر" },
            { name: "ریلمی" },
          ],
        },
        {
          itemTile: "گوشی بر اساس قیمت",
          colNumber: 2,
          elements: [
            { name: "گوشی ارزان" },
            { name: "گوشی موبایل قسطی" },
            { name: "گوشی تا دو ملیون تومن" },
            { name: "گوشی تا پنج ملیون تومن" },
            { name: "گوشی تا هفت ملیون تومن" },
            { name: "گوشی تا پونزده ملیون تومن" },
            { name: "گوشی بالای پونزده ملیون تومن" },
          ],
        },
        {
          itemTile: "گوشی بر اساس عملکرد",
          colorNumber: 2,
          elements: [
            { name: "گوشی گیمینگ" },
            { name: "گوشی 5G" },
            { name: "‌گوشی دکمه‌ای" },
            { name: "گوشی زد آب" },
            { name: "گوشی مناسب عکاسی" },
            { name: "گوشی میان رده" },
            { name: "گوشی اقتصادی و ارزان" },
            { name: "گوشی دانش‌آموزی" },
            { name: "گوشی پرچم دار" },
            { name: "گوشی دو سیمکارت" },
          ],
        },
        {
          itemTile: "گوشی بر اساس حافظه‌ی داخلی",
          colNumber: 2,
          elements: [
            { name: "گوشی 64 گیگابایت" },
            { name: "گوشی 128 گیگابایت" },
            { name: "گوشی 256 گیگابایت" },
            { name: "گوشی 512 گیگابایت" },
            { name: "گوشی 1 ترابایت" },
          ],
        },
        {
          itemTile: "رزولوشن عکس",
          colNumber: 2,
          elements: [
            { name: "گوشی با دوربین 48 مگاپیکسل" },
            { name: "گوشی با دوربین 50 مگاپیکسل" },
            { name: "گوشی با دوربین 64 مگا پیکسل" },
            { name: "گوشی با دوربین 108 مگاپیکسل" },
          ],
        },
        {
          itemTile: "لوازم جانبی موبایل",
          colNumber: 3,
          elements: [
            { name: "شارژر گوشی" },
            { name: "شارژر وایرلس" },
            { name: "گلس گوشی" },
            { name: "قاب و کاور گوشی" },
            { name: "هولدر گوشی موبایل" },
            { name: "کابل شارژر و مبدل" },
            { name: "پاور بانک (شارژر همراه)" },
          ],
        },
        {
          itemTile: "تبلت",
          colNumber: 3,
          elements: [
            { name: "تبلت سامسونگ" },
            { name: "تبلت اپل (آیپد)" },
            { name: "تبلت شیائومی" },
            { name: "تبلت لنوو" },
            { name: "تبل مایکروسافت" },
            { name: "تبلت دانش آموزی" },
          ],
        },
        {
          itemTile: "هدفون",
          colNumber: 3,
          elements: [
            { name: "هدفون بی سیم" },
            { name: "هدفون اپل (ایر پاد)" },
            { name: "هدفون بیتس" },
            { name: "هدفون سونی" },
            { name: "هدفون سامسونگ (ایرپادز)" },
            { name: "هدفون شیائومی" },
            { name: "هدفون جی دی ال" },
          ],
        },
        {
          itemTile: "ساعت و مچ بند هوشمند",
          colNumber: 3,
          elements: [
            { name: "ساعت هوشمند سامسونگ" },
            { name: "ساعت هوشمند شیائومی" },
            { name: "اپل واچ" },
          ],
        },
        {
          itemTile: "داغ ترین ها",
          colNumber: 4,
          elements: [
            { name: "گوشی S25 سامسونگ" },
            { name: "آیفون 16" },
            { name: "آیفون 16 پرومکس" },
            { name: "شادژر فندکی" },
            { name: "هولدر گردنی" },
            { name: "آیفون 13" },
            { name: "آیفون 12" },
            { name: "آیفون 11" },
            { name: "گوشی سامسونگ سری a" },
            { name: "گوشی سامسونگ سری s" },
            { name: "گوشی سامسونگ سری m" },
            { name: "کاور ایرپاد" },
            { name: "داریا باند 5G" },
            { name: "پوکو M5s" },
            { name: "گلکسی S23 ultra" },
            { name: "ردمی نوت 12" },
            { name: "گلسی S23 SE" },
            { name: "گلسی S23 SE" },
            { name: "گلکسی A14" },
            { name: "گلکسی A24" },
            { name: "گلکسی A34" },
            { name: "گلکسی A54" },
            { name: "قاب گوسی سامسونگ" },
            { name: "قاب گوشی آیفون" },
            { name: "قاب گوشی ریلمی" },
            { name: "قاب گوشی وکال" },
          ],
        },
      ],
    }),
    [],
  );
  return (
    <>
        <CategoryItems device={device} Items={phoneItems} />
    </>
  );
}

export default memo(Phone);
